<template>
  <div class="about">
    <div class="wrapper">
      <div class="banner"></div>
      <v-wrapper>
        <div slot="tab-wrapper">
          <tab-menu @selectItem="selectItem" :menuList="menuList" :currentIdx="currentIdx"></tab-menu>
        </div>
        <div slot="right-wrapper">
          <div v-if="currentIdx===0">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.aboutUs"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <img src="./img/about-bg-1.jpg.png" alt="">
              <h3>◆ 尊宝简介 ◆</h3>
              <p>
                Zb11.com尊宝国际隶属于—PIONEER SOLUTIONS TECHNOLOGY DEVELOPMENT
                LIMITED。注册于菲律宾，zb11.com并持有菲律宾PAGCOR合法博彩牌照。随着现时科技水平不断地创新，亚洲顶级娱乐旗舰zb11.com尊宝国际也持续以领跑者的姿态在真人娱乐城，老虎机，方面推动整个博彩行业的变革及创新。我们的使命是作为行业领袖，致力打造亚洲最有影响力的品牌，为您提供最高品质的客户服务，最友善的使用界面，最创新的产品，最享受的游戏体验，最无忧的账户安全保障，以及最可靠的游戏环境。
                <br>Zb11.com团队致力于为您提供：前沿性的产品及服务，安全快捷的彩金支付，以及最有价值的客户优惠。
              </p>
              <h3>◆ 优势 ◆</h3>
              <p>
                Zb11.com多渠道的存款方式，业界最快的提款速度，采用256位SSL国际标准加密技术及专业的客服团队7*24为您服务。我们秉承客户至上的理念，为您提供安全，便捷，放心的优质服务。
                1，秒存，秒提，技术团队独立研发，业界首创。 2，zb11.com日结佣金，世界首创。 3，多产品，大平台，让客户玩的更尽兴。 4，在市场上面享有优质的公信力，不容置疑。
                5，详细的分析报表功能，让您钱途无量，事事顺利。 6，支持多种支付方式，微信，支付宝，等等让您无需束缚。
              </p>
            </div>
          </div>
          <div v-if="currentIdx===1">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.agreement"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <h3>一、账户条例</h3>
              <p>
                用户注册《尊宝》游戏帐户，表示用户已确实详阅、理解并同意《尊宝》各项使用规范、游戏规则、各项条款且同意自行承担相应的法律责任；如若不同意《尊宝》任一项协议、条款、规范的内容，用户应立即停止使用尊宝提供的各项服务。
                <br>享用《尊宝》提供的服务是用户本人意愿，参与《尊宝》服务的同时，均视为用户理解和接受输赢风险且其风险由用户自行承担，用户认同《尊宝》所提供的服务是正常、合理、公正、公平的。
                <br>用户声明并承诺，用户在注册开户时所提供的资料，包括用户姓名、电邮地址、电话号码、IP地址，均真实、准确、完整，一但注册，除特殊原因将无法更改。
                <br>用户注册的游戏账户姓名必须与用户身份证、银行账户一致，若不一致，恕《尊宝》无法提供部份服务。
                <br>若发现用户以任何不正当的方式登入或参与任何游戏，《尊宝》有权拒绝服务该用户，并在不通知的情况下冻结或关闭相关游戏账号，不退还任何款项。
                <br>为避免任何争议，各用户参与《尊宝》所有游戏过程中或在结束游戏前，务必检查游戏帐户资料，如发现任何异常情况，应立即与客服联系查证，否则视为同意并接受：其帐户之一切数据或历史数据，以《尊宝》资料库的资料为准，用户不得异议。
                <br>
                用户拥有超过一个游戏账号，包括同姓名、同一邮件地址、同一家庭、同一住址、同一借记卡/信用卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被将视为联合游戏帐号或可疑游戏账号，本网站有权在不通知的情况下冻结或关闭相关游戏账号，并不退还任何款项。
                <br>所有账户若出现资金有误，用户有义务及时通知本网站调整，且不可使用相关错误金额，任何情况下，相关错误金额被视为无效金额，若用户使用该笔金额进行投注，所有投注被视为无效，一律取消并返还於本网站。
                <br>禁止职业算几率，采用首存及其他优惠等进行不正当下注，若经发现本网站有权在不通知的情况下冻结或关闭相关游戏账户，并不退还款项。
                <br>如果用户电脑配件的结果与《尊宝》服务器赛果不一致，以平台服务器所显示的结果将为最终赛果。用户也认同参与《尊宝》服务的游戏规则，投注状况《尊宝》拥有最终解释权。
                <br>严禁用户用非真实IP地址登录游戏（vpn、远程主机等）。
                <br>用户如有违反本服务条款，《尊宝》有权随时依据相关规则暂停或中止用户使用各项服务。
                <br>用户需认同本协议部分或全部内容是临时性的尊宝娱乐保留随时更改公司服务与各项条款之权力，有权添加、修正或修改各项协议，原因包括但不限于商业原因、遵守监管机构的法律法规、指示、指导或建议或客户服务原因。这些信息仅供参考，在用户与本司之间并不构成协议，合同，和担保的依据，最新的规则与条款可通过网站下方用户协议链接查阅。
                <br>无论任何情况，尊宝娱乐城拥有最终决定权。
              </p>
              <h3>二、存款条例</h3>
              <p>
                通过网银自助存款方式的会员，如果忘记填写附言，请及时联系在线客服。特别说明如果出现存款人姓名与游戏账户姓名不一致的情况，请配合提供网银电子回单，以便财务人员进行补单。
                <br>通过第三方支付进行存款的会员，如果出现掉单的情况，请及时联系在线客服，并提供订单号，存款金额，存款时间，以便我们尽快为您补单。
              </p>
              <h3>三、提款条例</h3>
              <p>
                用户每日提款次数不限。用户每日最高派彩金额1000万人民币，即所有玩法总和的派彩金额。
                <br>最低提款额度为100元，当日提款总额度无上限。
                <br>用户申请提款若遇到配合平台抽查，需全力配合，此不在《尊宝》秒提、五分钟提款的承诺范围，平台抽查完毕，若无问题，《尊宝》会于第一时间为用户出款。
                <br>所有提款申请必须符合本网站的提款政策，如存款未达到全额投注，即无法通过提款审核，提款申请将会被驳回。
                <br>若有需要，用户必须提供个人资料如身份证副本、驾驶执照副本、银行交易记录截图、居民户口簿副本等资料。
                <br>用户被严禁使用他人或第三者银行账户或银行卡进行取款业务。
                <br>《尊宝》秒提、五分钟提款的承诺不包含系统异常、银行维护、网路延迟。
                <br>任何会员在老虎机游戏幸运中奖池奖金50000以上，将扣除30%~40%的费用做为平台建设。
                <br>无论任何情况，《尊宝》拥有最终决定权。
              </p>
              <h3>四、优惠条例</h3>
              <p>
                若要享有《尊宝》优惠红利或回赠，用户必须符合活动相关规则及所有条例、附加条款。
                <br>用户涉及个人或团体以不正当的手法，进行骗取或诈骗相关优惠奖金，《尊宝》有权在不通知的情况下冻结或关闭相关账户，并不退还款项，用户将会被列入黑名单，并保留追究权利。
                <br>用户拥有超过一个账户，包括同一姓名、同一邮件地址、同一住址、同一借记卡/信用卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被视为联合账户或可疑账户。
                <br>一但发现该用户有无风险投注，在尊宝娱乐城除老虎机游戏以外的游戏有对赌行为，《尊宝》有权在不通知的情况下冻结或关闭相关账户，并不退还款项，用户将会被列入黑名单，并保留追究权利。
                <br>《尊宝》有权根据会员情况调整会员投注限额。
                <br>《尊宝》拥有对所有优惠活动在无通知的情况下修改及最终解释的权力。
                <br>无论任何情况，尊宝娱乐城拥有最终决定权。
              </p>
            </div>
          </div>
          <div v-if="currentIdx===2">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.duty"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <p>
                尊宝打造全民娱乐博弈平台，我们追求的是让玩家有一种放松、无忧的一个游戏环境，一直以小玩怡情的理念创造一款适合平时休息时间进行的一款游戏。
              </p>
              <h3>一、博彩答问调查</h3>
              <p>
                您会否因为博彩而不上班或不上学？
                <br>您博彩是否为了逃避烦闷或不愉快的生活？
                <br>您若投注博彩花光额度时，是否感到失望甚至绝望，并且希望马上能再进行博彩游戏？
                <br>您会否博彩到最后一分钱才罢休？
                <br>您有否曾经用谎言掩饰您花在博彩上的时间和金钱？
                <br>是否有人批评过您的博彩行为？
                <br>您是否对您的家人，朋友或爱好失去了兴趣？
                <br>您输了之后，是否马上想把输的钱赢回来？
                <br>您博彩是不是因为争执，沮丧或失望？
                <br>您有没有因为博彩而感到失落甚至轻生？
                <br>在这些问题中您回答的『是』越多，表示越接近具备严重沉迷博彩的状态，以下观念及建言，也许能帮助您改变想法自控，脱离沉迷博彩游戏：

                <br>博彩只是一种娱乐，不应被视为赚钱的方法。
                <br>游戏时，避免有太重的得失心，输也好赢也好，享受博彩一瞬间的刺激及乐趣。
                <br>避免有把输的钱赢回来的想法，博彩是种娱乐，赢自然开心，输也享受到游戏的过程。
                <br>在经济允许的范围内进行投注，小赌怡情，大赌伤身。
                <br>时刻控制花在博彩游戏上的时间和金钱，博彩游戏是种娱乐，不该影响到个人生活。
                <br>若您暂时不想参予博彩游戏，可以联系客服为您关闭账户。
              </p>
              <h3>二、家长监控</h3>
              <p>
                父母或者监护人，可使用一系列第三方软件来监控或限制电脑的互联网使用，避免儿童在家人不知情的状况下接触博彩游戏：

                <br>Net Nanny过滤软件防止儿童浏览不适宜的网站内容: www.netnanny.com
                <br>CYBERsitter过滤软件允许父母增加自定义过滤网站: www.cybersitter.com
              </p>
            </div>
          </div>
          <div v-if="currentIdx===3">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.rule"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <p>
                用户认同所有免责条款都是在公平、公正，风险及利益分布合理的情况下成立，它既反映《尊宝》对用户的关注，也体现用户对《尊宝》的理解与支持。认同此条款的合法性和实施性。
                <br>某些法律规则并未明文规定在线和非在线博彩是否合法，而有些法律规则已有明确规定。如果按照用户当地法律博彩属不合法行为，本公司不提倡阁下参与《尊宝》服务。在博彩被视为不合法行为的任何国家，《尊宝》不提倡其国民加入。用户有责任确保任何时候您的博彩行为在您所属地是属合法行为，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理不承担因用户违反当地法律所引致之任何责任。
                <br>用户必须符合法定年龄（用户其居住地区的法律年龄限制），且在不违反当地法律的情况下，使用《尊宝》的服务，一旦发现参予游戏的用户未满18岁，《尊宝》有权冻结或关闭相关游戏账号，不退还任何款项，建议用户可以设置电脑使用者，避免儿童接触游戏，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理不承担因用户违反当地法律所引致之任何责任。
                <br>用户安装、使用或参与《尊宝》任何游戏、软件、信息等各项服务，若有发生任何技术性问题、网络问题（例如：卫星收讯不良或网路延误、中断），人为操作疏失等不明因素或对《尊宝》内容误解，而直接、间接、附带或因此导致之衍生性损失，不论《尊宝》是否被告知其可能性，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理概不负责。
                <br>由于第三方对《尊宝》网站和信息提供的服务（比如无线通讯的提供者等）而导致的拖延、违约、或不提供服务的情况，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理概不负责。
                <br>尊宝娱乐城尽全力为用户提供最优质，最安全可靠的服务，然而并不担保《尊宝》所提供的服务的稳定性、及时性和准确性，不担保错误及时更正或网站不受病毒、蠕虫干扰。
                <br>《尊宝》有权临时或永久性立即暂停、终止、修改、删除或添加服务内容，而无需通知用户，对因其而产生的任何损失，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理概不负责。
                <br>用户应保持稳定的连线游戏《尊宝》各游戏平台，经PT、MG、DT、NT、QT游戏平台反馈游戏断线问题，断线保护不包含免费游戏，只退还当时投注的本金，若出现免费游戏卡顿或掉线问题，是由于玩家自身的网络不稳定所造成，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理概不负责。
                <br>
                每个游戏账号皆只限持有者一人使用，用户有责任确保游戏账号及密码隐私安全，如用户有意/无意透露或泄露账户资料导致被盗，或第三方以任何形式获得用户的游戏账户及密码进行游戏，导致用户账户损失，所有损失及责任需由用户全部承担，恕《尊宝》及相关合伙公司，合作伙伴、合伙人、职员、代理概不负责。
                <br>无论任何情况，尊宝娱乐城拥有最终决定权。
              </p>
            </div>
          </div>
          <div v-if="currentIdx===4">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.protect"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <p>
                《尊宝》的头等重任，就是保证用户的个人资料及数据安全，
                《尊宝》承诺不会将用户的个人信息分享或出售给任何第三方，绝对不泄露用户的个人资料，数据库仅限内部技术员工使用，所有的在线客服都无法查看。因此尊宝娱乐城与我们的合作伙伴会通过邮件将您可能感兴趣的促销优惠发送给您；但除此之外，除非收到法庭传单或应可行法律的要求及判决，您的讯息才可能被披露。

                <br>尊宝娱乐城有权通过网站向相关付款平台服务提供商及金融保险机构，提供必要的个人信息，以完成付款要求，所有用户提供的个人信息，其传送都将通过安全端口（ 128位 SSL
                加密标准）并存放在公众无法进入的保密环境之下，对于有机会接触用户个人资料的协助伙伴，也必需遵守《尊宝》订立的保密规则，所有数据的内部出入都受到严格的限制及严密的监控。

                <br>未经尊宝娱乐城明确书面授权，任何人不得散布、变更、复制、转载、使用《尊宝》任何内容，或在非《尊宝》所属服务器作镜像，否则以侵权论，依法追究法律责任。

                <br>尊宝娱乐城不会永久保存用户信息，所有信息将按照本隐私政策进行。
              </p>
            </div>
          </div>
          <div v-if="currentIdx===5">
            <tab-title @selectItem="selectTabTitleItem" :tab-title-list="tabTitleList.contact"
                       :currentIdx="currentTabTitleIdx"></tab-title>
            <div class="border-content about-content">
              <p>
                尊宝娱乐城为您提供 7*24 小时的在线咨询服务。 欢迎您通过以下的联系方式随时联系我们，我们会全力于第一时间提供您最优质的服务。

                <br>备用网址：

                <br>在线客服：直接官网右侧点击

                <br>电话客服：登入备用网址，点击电话回拨，输入电话号码，客服会于收到讯息的第一时间回拨

                <br>尊宝邮箱：kefu@zb970.com

                <br>尊宝微信公众号：zunbao111

                <br>尊宝市场部门QQ：aff@zb970.com

                <br>尊宝建议投诉区：ceo@zb970.com
              </p>
            </div>
          </div>
        </div>
      </v-wrapper>
    </div>
  </div>
</template>

<script>
  import VWrapper from '@/components/wrapper/wrapper'
  import TabMenu from '@/components/tab-menu/tab-menu'
  import TabTitle from '@/components/tab-title/tab-title'

  export default {
    data() {
      return {
        menuList: [
          {
            text: '关于我们',
            icon: 'guanyuwomen'
          },
          {
            text: '用户协议',
            icon: 'declare'
          },
          {
            text: '博彩责任',
            icon: 'zuzhizeren'
          },
          {
            text: '免责条款',
            icon: 'yonghuxieyi'
          },
          {
            text: '隐私保护',
            icon: 'guanfangrenzheng'
          },
          {
            text: '联系我们',
            icon: 'kefu'
          }
        ],
        currentIdx: 0,
        tabTitleList: {
          aboutUs: [
            {
              text: '关于我们'
            },
          ],
          agreement: [
            {
              text: '用户协议'
            }
          ],
          duty: [
            {
              text: '博彩责任'
            }
          ],
          rule: [
            {
              text: '免责条款'
            }
          ],
          protect: [
            {
              text: '隐私保护'
            }
          ],
          contact: [
            {
              text: '联系我们'
            }
          ]
        },
        currentTabTitleIdx: 0
      }
    },
    computed: {},
    created() {

    },
    methods: {
      selectItem(idx) {
        this.currentIdx = idx
      },
      selectTabTitleItem(idx) {
        this.currentTabTitleIdx = idx
      }
    },
    watch: {
      '$route.query.queryId'(val) {
        if (val === 'aboutUs') {
          this.currentIdx = 0
        }
        if (val === 'agreement') {
          this.currentIdx = 1
        }
        if (val === 'duty') {
          this.currentIdx = 2
        }
        if (val === 'rule') {
          this.currentIdx = 3
        }
        if (val === 'protect') {
          this.currentIdx = 4
        }
        if (val === 'contact') {
          this.currentIdx = 5
        }
      }
    },
    components: {
      VWrapper, TabMenu, TabTitle
    }

  }
</script>

<style src="./about.styl" lang="stylus" scoped>
</style>